bolknote/MK61S_MINI/tests/mk_math_self_test.cpp
// Хостовый самотест подсистемы CORE в mk_math.
//
// Собирает настоящее ядро МК-61 (mk61emu_core.cpp) вместе с математической
// подсистемой CORE (mk_math_core.cpp) и проверяет совпадение всех трансцендентных
// функций с libm в пределах 8-разрядной точности калькулятора, работу pow(),
// согласованность чистых вспомогательных функций без libm с <math.h> и
// неизменность рабочего пользовательского состояния при аренде ядра.

#include <cmath>
#include <climits>
#include <cstdio>
#include <cstdlib>
#include <cstring>
#include <limits>

#include "mk_math.hpp"       // MK61_MATH_BACKEND == CORE (задаётся через -D)
#include "mk61emu_core.h"

static int g_failures = 0;

static void check_near(const char* label, double got, double want, double tol) {
  const double diff = std::fabs(got - want);
  const double scale = std::fabs(want) > 1.0 ? std::fabs(want) : 1.0;
  if(diff > tol * scale) {
    std::printf("  FAIL %-14s got=%.10g want=%.10g diff=%.3g\n", label, got, want, diff);
    g_failures++;
  } else {
    std::printf("  ok   %-14s got=%.10g want=%.10g\n", label, got, want);
  }
}

static void check_true(const char* label, bool cond) {
  if(!cond) {
    std::printf("  FAIL %s\n", label);
    g_failures++;
  } else {
    std::printf("  ok   %s\n", label);
  }
}

static const char SYMBOLS[16] = {
    '0','1','2','3','4','5','6','7','8','9','-',' ',' ',' ',' ',' '
};

// Читает любой рабочий регистр стека так же, как интерпретаторы читают X.
static double read_live_reg(stack reg) {
  char value[15];
  value[14] = 0;
  read_stack_register(reg, value, SYMBOLS);

  char buffer[24];
  char* out = buffer;
  if(value[0] == '-') *out++ = '-';
  for(int i = 1; i <= 9; i++) {
    if(value[i] == ' ') continue;
    *out++ = value[i];
  }
  *out++ = 'e';
  *out++ = (value[11] == '-') ? '-' : '+';
  *out++ = value[12];
  *out++ = value[13];
  *out = 0;
  return mk_math::atof(buffer);
}

static double read_live_x(void) { return read_live_reg(stack::X); }

struct MatrixKey { int x, y; };

struct RomHookProbe {
  int calls;
  u8 last_address;
  u8 last_replacement;
  u8 replacement;
  bool replace;
  bool arrays_present;
};

struct CommandHookProbe {
  int calls;
  core_61::Mk61CommandHookPhase last_phase;
  core_61::Mk61CommandSource last_source;
  u8 last_opcode;
  u8 last_replacement;
  u32 last_sequence;
  bool replace;
  u8 replacement;
  bool override_x;
  bool try_nested_registration;
  core_61::Mk61CommandHookHandle nested_registration;
  int order_tag;
  int* order_log;
  int* order_count;
};

struct ProgramBoundaryProbe {
  int calls;
  u8 target;
  u8 last_address;
  u8 last_opcode;
  bool yield;
  u8 addresses[16];
  u8 opcodes[16];
};

static bool program_boundary_probe(
    const core_61::Mk61ProgramBoundaryContext& context, void* user_data) {
  ProgramBoundaryProbe* const probe = (ProgramBoundaryProbe*) user_data;
  if(probe->calls < (int) (sizeof(probe->addresses) / sizeof(probe->addresses[0]))) {
    probe->addresses[probe->calls] = context.address;
    probe->opcodes[probe->calls] = context.opcode;
  }
  probe->calls++;
  probe->last_address = context.address;
  probe->last_opcode = context.opcode;
  return probe->yield && context.address == probe->target;
}

static void rom_hook_probe(core_61::RomCommandHookContext& context, void* user_data) {
  RomHookProbe* const probe = (RomHookProbe*) user_data;
  probe->calls++;
  probe->last_address = context.address;
  probe->last_replacement = context.replacement_address;
  probe->arrays_present = context.r != nullptr && context.st != nullptr;
  if(probe->replace) context.replacement_address = probe->replacement;
}

static void command_hook_probe(
    core_61::Mk61CommandHookContext& context, void* user_data) {
  CommandHookProbe* const probe = (CommandHookProbe*) user_data;
  probe->calls++;
  probe->last_phase = context.phase;
  probe->last_source = context.source;
  probe->last_opcode = context.opcode;
  probe->last_replacement = context.replacement_opcode;
  probe->last_sequence = context.sequence;
  if(probe->order_log != nullptr && probe->order_count != nullptr) {
    probe->order_log[(*probe->order_count)++] = probe->order_tag;
  }
  if(probe->try_nested_registration) {
    probe->nested_registration = core_61::register_mk61_command_hook(
        0x00, core_61::Mk61CommandHookPhase::BEFORE_EXECUTE,
        &command_hook_probe, probe);
  }
  if(context.phase == core_61::Mk61CommandHookPhase::BEFORE_EXECUTE && probe->replace) {
    context.replacement_opcode = probe->replacement;
  }
  if(context.phase == core_61::Mk61CommandHookPhase::AFTER_EXECUTE && probe->override_x) {
    // bcd_value следует порядку цифр в последовательном кольце (сначала младшая
    // цифра дисплея), поэтому 4.2424242 кодируется как 0x24242424.
    const core_61::bcd_value replacement_x = {0x24242424U, 0};
    core_61::set_stack_register(stack::X, &replacement_x);
  }
}

static void press_matrix(MatrixKey key) {
  core_61::clear_displayed();
  for(int i = 0; i < 4; i++) {
    MK61Emu_SetKeyPress(key.x, key.y);
    core_61::step();
    if(core_61::is_RUN()) break;
  }
  MK61Emu_SetKeyPress(0, 0);
  for(int i = 0; i < 512; i++) {
    core_61::step();
    if(core_61::is_RUN() || core_61::is_displayed()) break;
  }
}

// Повторяет library_pmk::hidden_press_key(), которая рассчитывает на очистку
// эмулируемой матрицы в core_61::step(), а не на вызов SetKeyPress(0, 0).
static void press_matrix_without_explicit_release(MatrixKey key) {
  core_61::clear_displayed();
  for(int i = 0; i < 4; i++) {
    MK61Emu_SetKeyPress(key.x, key.y);
    core_61::step();
    if(core_61::is_RUN()) break;
  }
  for(int i = 0; i < 64; i++) {
    core_61::step();
    if(core_61::is_RUN() || core_61::is_displayed()) break;
  }
  core_61::clear_displayed();
}

static MatrixKey digit_key(u8 digit) {
  return {(int) digit + 2, 1};
}

static void set_x_bcd(u32 mantissa, u16 signs_and_pow = 0) {
  const core_61::bcd_value value = {mantissa, signs_and_pow};
  core_61::set_stack_register(stack::X, &value);
}

static void store_direct(u8 reg, u32 mantissa) {
  set_x_bcd(mantissa);
  press_matrix({6, 9}); // X->P
  press_matrix(digit_key(reg));
}

static void prepare_indirect_registers(void) {
  core_61::enable();
  store_direct(5, 0x11111111U);
  store_direct(6, 0x22222222U);
  store_direct(7, 0x00000005U);
  store_direct(8, 0x00000006U);
}

