bolknote/MK61S_MINI/tests/mk_math_self_test.cpp
static void press_kip7(void) {
  press_matrix({10, 9}); // K
  press_matrix({8, 9});  // P->X
  press_matrix(digit_key(7));
}

static void run_program(const u8* code, usize length) {
  u8 page[core_61::CODE_PAGE_BUFFER_SIZE] = {};
  for(usize i = 0; i < core_61::program_steps(); i++) page[i] = 0x50;
  for(usize i = 0; i < length && i < core_61::program_steps(); i++) page[i] = code[i];
  core_61::set_code_page(page);
  core_61::set_IP(0);
  press_matrix({2, 9}); // C/P
  for(int i = 0; i < 256 && core_61::is_RUN(); i++) core_61::step();
}

static void test_mk61_command_hooks(void) {
  std::printf("MK-61 user command hook registry:\n");
  core_61::configure_random_seed(false, 1);
  check_true("command registry empty",
      core_61::registered_mk61_command_hook_count() == 0);

  prepare_indirect_registers();
  int order[4] = {};
  int order_count = 0;
  CommandHookProbe replacer = {};
  replacer.replace = true;
  replacer.replacement = 0xD8;
  replacer.try_nested_registration = true;
  replacer.order_tag = 1;
  replacer.order_log = order;
  replacer.order_count = &order_count;
  CommandHookProbe observer = {};
  observer.order_tag = 2;
  observer.order_log = order;
  observer.order_count = &order_count;
  CommandHookProbe after = {};
  CommandHookProbe replacement_target = {};

  const core_61::Mk61CommandHookHandle replace_handle =
      core_61::register_mk61_command_hook(
          0xD7, core_61::Mk61CommandHookPhase::BEFORE_EXECUTE,
          &command_hook_probe, &replacer);
  const core_61::Mk61CommandHookHandle observe_handle =
      core_61::register_mk61_command_hook(
          0xD7, core_61::Mk61CommandHookPhase::BEFORE_EXECUTE,
          &command_hook_probe, &observer);
  const core_61::Mk61CommandHookHandle after_handle =
      core_61::register_mk61_command_hook(
          0xD7, core_61::Mk61CommandHookPhase::AFTER_EXECUTE,
          &command_hook_probe, &after);
  const core_61::Mk61CommandHookHandle replacement_target_handle =
      core_61::register_mk61_command_hook(
          0xD8, core_61::Mk61CommandHookPhase::BEFORE_EXECUTE,
          &command_hook_probe, &replacement_target);
  check_true("four command hooks registered",
      replace_handle != core_61::INVALID_MK61_COMMAND_HOOK &&
      observe_handle != core_61::INVALID_MK61_COMMAND_HOOK &&
      after_handle != core_61::INVALID_MK61_COMMAND_HOOK &&
      replacement_target_handle != core_61::INVALID_MK61_COMMAND_HOOK &&
      core_61::registered_mk61_command_hook_count() == 4);

  const u8 indirect_program[] = {0xD7, 0x50};
  run_program(indirect_program, sizeof(indirect_program));
  check_near("program D7->D8", read_live_x(), 2.2222222, 1e-8);
  check_true("program BEFORE source/opcode",
      replacer.calls == 1 &&
      replacer.last_phase == core_61::Mk61CommandHookPhase::BEFORE_EXECUTE &&
      replacer.last_source == core_61::Mk61CommandSource::PROGRAM &&
      replacer.last_opcode == 0xD7);
  check_true("same-opcode registration order",
      order_count == 2 && order[0] == 1 && order[1] == 2 &&
      observer.last_replacement == 0xD8);
  check_true("replacement not redispatched",
      replacement_target.calls == 0);
  check_true("program AFTER result point",
      after.calls == 1 &&
      after.last_phase == core_61::Mk61CommandHookPhase::AFTER_EXECUTE &&
      after.last_source == core_61::Mk61CommandSource::PROGRAM &&
      after.last_opcode == 0xD7 && after.last_replacement == 0xD8 &&
      after.last_sequence == replacer.last_sequence);
  check_true("nested registration rejected",
      replacer.nested_registration == core_61::INVALID_MK61_COMMAND_HOOK);

  check_true("remove program replacer",
      core_61::unregister_mk61_command_hook(replace_handle));
  check_true("reject stale command handle",
      !core_61::unregister_mk61_command_hook(replace_handle));
  check_true("remove program observer",
      core_61::unregister_mk61_command_hook(observe_handle));
  check_true("remove program after",
      core_61::unregister_mk61_command_hook(after_handle));
  check_true("remove replacement target",
      core_61::unregister_mk61_command_hook(replacement_target_handle));

  prepare_indirect_registers();
  CommandHookProbe keyboard_before = {};
  keyboard_before.replace = true;
  keyboard_before.replacement = 0xD8;
  CommandHookProbe keyboard_after = {};
  const core_61::Mk61CommandHookHandle keyboard_before_handle =
      core_61::register_mk61_command_hook(
          0xD7, core_61::Mk61CommandHookPhase::BEFORE_EXECUTE,
          &command_hook_probe, &keyboard_before);
  const core_61::Mk61CommandHookHandle keyboard_after_handle =
      core_61::register_mk61_command_hook(
          0xD7, core_61::Mk61CommandHookPhase::AFTER_EXECUTE,
          &command_hook_probe, &keyboard_after);
  press_kip7();
  check_near("keyboard D7->D8", read_live_x(), 2.2222222, 1e-8);
  check_true("keyboard BEFORE source",
      keyboard_before.calls == 1 &&
      keyboard_before.last_source == core_61::Mk61CommandSource::KEYBOARD);
  check_true("keyboard AFTER source/result",
      keyboard_after.calls == 1 &&
      keyboard_after.last_source == core_61::Mk61CommandSource::KEYBOARD &&
      keyboard_after.last_replacement == 0xD8 &&
      keyboard_after.last_sequence == keyboard_before.last_sequence);
  check_true("remove keyboard BEFORE",
      core_61::unregister_mk61_command_hook(keyboard_before_handle));
  check_true("remove keyboard AFTER",
      core_61::unregister_mk61_command_hook(keyboard_after_handle));

  prepare_indirect_registers();
  CommandHookProbe override = {};
  override.override_x = true;
  const core_61::Mk61CommandHookHandle override_handle =
      core_61::register_mk61_command_hook(
          0xD7, core_61::Mk61CommandHookPhase::AFTER_EXECUTE,
          &command_hook_probe, &override);
  press_kip7();
  check_near("AFTER KIP7 overrides X", read_live_x(), 4.2424242, 1e-8);
  check_true("KIP7 AFTER called once", override.calls == 1);
  prepare_indirect_registers();
  run_program(indirect_program, sizeof(indirect_program));
  check_near("program AFTER KIP7 overrides X", read_live_x(), 4.2424242, 1e-8);
  check_true("program KIP7 AFTER called once", override.calls == 2);
  check_true("remove KIP7 override",
      core_61::unregister_mk61_command_hook(override_handle));
  press_matrix({8, 9});
  press_matrix(digit_key(5));
  check_near("KIP7 override keeps R5", read_live_x(), 1.1111111, 1e-8);
  press_matrix({8, 9});
  press_matrix(digit_key(7));
  check_near("KIP7 override keeps R7", read_live_x(), 5.0, 1e-8);

  prepare_indirect_registers();
  CommandHookProbe no_release = {};
  const core_61::Mk61CommandHookHandle no_release_handle =
      core_61::register_mk61_command_hook(
          0xD7, core_61::Mk61CommandHookPhase::AFTER_EXECUTE,
          &command_hook_probe, &no_release);
  press_matrix_without_explicit_release({10, 9});
  press_matrix_without_explicit_release({8, 9});
  press_matrix_without_explicit_release(digit_key(7));
  check_true("keyboard AFTER without explicit release", no_release.calls == 1);
  check_true("remove no-release hook",
      core_61::unregister_mk61_command_hook(no_release_handle));

  CommandHookProbe one = {};
  CommandHookProbe two = {};
  CommandHookProbe stop = {};
  const core_61::Mk61CommandHookHandle one_handle =
      core_61::register_mk61_command_hook(
          0x01, core_61::Mk61CommandHookPhase::AFTER_EXECUTE,
          &command_hook_probe, &one);
  const core_61::Mk61CommandHookHandle two_handle =
      core_61::register_mk61_command_hook(
          0x02, core_61::Mk61CommandHookPhase::AFTER_EXECUTE,
          &command_hook_probe, &two);
  const core_61::Mk61CommandHookHandle stop_handle =
      core_61::register_mk61_command_hook(
          0x50, core_61::Mk61CommandHookPhase::AFTER_EXECUTE,
          &command_hook_probe, &stop);
  const u8 consecutive_program[] = {0x01, 0x02, 0x50};
  run_program(consecutive_program, sizeof(consecutive_program));
  check_true("several opcodes intercepted",
      one.calls == 1 && two.calls == 1 && stop.calls == 1);
  check_true("consecutive command sequences",
      one.last_sequence < two.last_sequence && two.last_sequence < stop.last_sequence);
  check_true("remove opcode 01", core_61::unregister_mk61_command_hook(one_handle));
  check_true("remove opcode 02", core_61::unregister_mk61_command_hook(two_handle));
  check_true("remove opcode 50", core_61::unregister_mk61_command_hook(stop_handle));

  core_61::configure_random_seed(true, 1234567);
  CommandHookProbe capacity_probes[core_61::MK61_COMMAND_HOOK_CAPACITY] = {};
  core_61::Mk61CommandHookHandle capacity_hooks[core_61::MK61_COMMAND_HOOK_CAPACITY] = {};
  bool capacity_ok = true;
  for(usize i = 0; i < core_61::MK61_COMMAND_HOOK_CAPACITY; i++) {
    capacity_hooks[i] = core_61::register_mk61_command_hook(
        (u8) i, core_61::Mk61CommandHookPhase::BEFORE_EXECUTE,
        &command_hook_probe, &capacity_probes[i]);
    capacity_ok &= capacity_hooks[i] != core_61::INVALID_MK61_COMMAND_HOOK;
  }
  check_true("public command-hook capacity", capacity_ok);
  const core_61::Mk61CommandHookHandle overflow =
      core_61::register_mk61_command_hook(
          0xFF, core_61::Mk61CommandHookPhase::BEFORE_EXECUTE,
          &command_hook_probe, &capacity_probes[0]);
  check_true("command-hook capacity enforced",
      overflow == core_61::INVALID_MK61_COMMAND_HOOK);
  check_true("RNG command hook has reserved slot",
      core_61::random_seed_enabled() &&
      core_61::registered_mk61_command_hook_count() ==
          core_61::MK61_COMMAND_HOOK_CAPACITY);
  core_61::configure_random_seed(false, 1);
  for(core_61::Mk61CommandHookHandle handle : capacity_hooks) {
    check_true("command capacity unregister",
        core_61::unregister_mk61_command_hook(handle));
  }
  check_true("command registry cleanup",
      core_61::registered_mk61_command_hook_count() == 0);
}

static void test_rom_command_hooks(void) {
  std::printf("ROM command hook registry:\n");
  core_61::configure_random_seed(false, 1);
  check_true("hook registry empty", core_61::registered_rom_command_hook_count() == 0);

  // Используем адрес команды IK1306 с тем же словом ПЗУ, что и по адресу 00.
  // Так тест проверяет настоящую подстановку, не меняя поведение сброса.
  u8 ik1306_alias = 0;
  const u32 command_00 = core_61::rom_command_instruction(core_61::RomChip::IK1306, 0);
  for(u16 address = 1; address <= 0xFF; address++) {
    if(core_61::rom_command_instruction(core_61::RomChip::IK1306, (u8) address) == command_00) {
      ik1306_alias = (u8) address;
      break;
    }
  }
  check_true("ROM alias found", ik1306_alias != 0);

  RomHookProbe ik1302 = {};
  RomHookProbe ik1303 = {};
  RomHookProbe replacer = {};
  replacer.replace = true;
  replacer.replacement = ik1306_alias;
  RomHookProbe observer = {};

  const core_61::RomCommandHookHandle hook_1302 = core_61::register_rom_command_hook(
      core_61::RomChip::IK1302, 0, &rom_hook_probe, &ik1302);
  const core_61::RomCommandHookHandle hook_1303 = core_61::register_rom_command_hook(
      core_61::RomChip::IK1303, 0, &rom_hook_probe, &ik1303);
  const core_61::RomCommandHookHandle hook_replace = core_61::register_rom_command_hook(
      core_61::RomChip::IK1306, 0, &rom_hook_probe, &replacer);
  const core_61::RomCommandHookHandle hook_observe = core_61::register_rom_command_hook(
      core_61::RomChip::IK1306, 0, &rom_hook_probe, &observer);

  check_true("four hooks registered",
      hook_1302 != core_61::INVALID_ROM_COMMAND_HOOK &&
      hook_1303 != core_61::INVALID_ROM_COMMAND_HOOK &&
      hook_replace != core_61::INVALID_ROM_COMMAND_HOOK &&
      hook_observe != core_61::INVALID_ROM_COMMAND_HOOK &&
      core_61::registered_rom_command_hook_count() == 4);

  core_61::enable();
  check_true("different commands fire", ik1302.calls > 0 && ik1303.calls > 0);
  check_true("same command chains", replacer.calls > 0 && observer.calls > 0);
  check_true("registration order", observer.last_replacement == ik1306_alias);
  check_true("hook context arrays",
      ik1302.arrays_present && ik1303.arrays_present &&
      replacer.arrays_present && observer.arrays_present);
  check_true("original address stable",
      replacer.last_address == 0 && observer.last_address == 0);

  check_true("unregister one", core_61::unregister_rom_command_hook(hook_1302));
  check_true("reject stale handle", !core_61::unregister_rom_command_hook(hook_1302));
  ik1302.calls = 0;
  ik1303.calls = 0;
  core_61::enable();
  check_true("removed hook stays off", ik1302.calls == 0);
  check_true("other hook stays on", ik1303.calls > 0);

  check_true("remove IK1303", core_61::unregister_rom_command_hook(hook_1303));
  check_true("remove replacer", core_61::unregister_rom_command_hook(hook_replace));
  check_true("remove observer", core_61::unregister_rom_command_hook(hook_observe));
  check_true("registry empty again", core_61::registered_rom_command_hook_count() == 0);

  RomHookProbe capacity_probes[core_61::ROM_COMMAND_HOOK_CAPACITY] = {};
  core_61::RomCommandHookHandle capacity_hooks[core_61::ROM_COMMAND_HOOK_CAPACITY] = {};
  bool capacity_ok = true;
  for(usize i = 0; i < core_61::ROM_COMMAND_HOOK_CAPACITY; i++) {
    capacity_hooks[i] = core_61::register_rom_command_hook(
        core_61::RomChip::IK1302, (u8) i, &rom_hook_probe, &capacity_probes[i]);
    capacity_ok &= capacity_hooks[i] != core_61::INVALID_ROM_COMMAND_HOOK;
  }
  check_true("public hook capacity", capacity_ok);
  const core_61::RomCommandHookHandle overflow = core_61::register_rom_command_hook(
      core_61::RomChip::IK1303, 0, &rom_hook_probe, &ik1303);
  check_true("capacity enforced", overflow == core_61::INVALID_ROM_COMMAND_HOOK);
  core_61::configure_random_seed(true, 1234567);
  check_true("RNG reserved slot", core_61::random_seed_enabled() &&
      core_61::registered_rom_command_hook_count() == core_61::ROM_COMMAND_HOOK_CAPACITY);
  core_61::configure_random_seed(false, 1);
  for(core_61::RomCommandHookHandle handle : capacity_hooks) {
    check_true("capacity unregister", core_61::unregister_rom_command_hook(handle));
  }
  check_true("capacity cleanup", core_61::registered_rom_command_hook_count() == 0);
}

static void test_pure_helpers(void) {
  std::printf("pure helpers vs <math.h>:\n");
  const double xs[] = {3.14, -3.14, 2.5, -2.5, 0.0, 7.0, -7.0, 123.456, -0.001};
  for(double x : xs) {
    check_near("floor", mk_math::floor(x), std::floor(x), 1e-12);
    check_near("ceil", mk_math::ceil(x), std::ceil(x), 1e-12);
    check_near("trunc", mk_math::trunc(x), std::trunc(x), 1e-12);
    check_near("fabs", mk_math::fabs(x), std::fabs(x), 1e-12);
  }
  check_near("pow10_int+3", mk_math::pow10_int(3), 1000.0, 1e-12);
  check_near("pow10_int-2", mk_math::pow10_int(-2), 0.01, 1e-12);
  check_true("pow10_int max", mk_math::is_inf(mk_math::pow10_int(INT_MAX)));
  check_true("pow10_int min", mk_math::pow10_int(INT_MIN) == 0.0);
  check_true("log10_floor 100", mk_math::log10_floor(100.0) == 2);
  check_true("log10_floor 0.01", mk_math::log10_floor(0.01) == -2);
  check_true("log10_floor 5", mk_math::log10_floor(5.0) == 0);
  check_true("log10_floor 0.5", mk_math::log10_floor(0.5) == -1);

