bolknote/MK61S_MINI/tests/mk_math_self_test.cpp
  // Штатное ПЗУ выдавало лишь 179 разных значений (префикс из 26 значений и
  // цикл из 153). Улучшенный режим не должен наследовать этот короткий повтор;
  // допускаем несколько коллизий дней рождения в 7-разрядном пространстве.
  core_61::configure_random_seed(true, 99887766);
  core_61::enable();
  static constexpr int SAMPLE_COUNT = 256;
  u32 values[SAMPLE_COUNT] = {};
  int unique = 0;
  for(int i = 0; i < SAMPLE_COUNT; i++) {
    const u32 value = (u32) std::llround(next_random() * 10000000.0);
    bool seen = false;
    for(int j = 0; j < unique; j++) seen |= values[j] == value;
    if(!seen) values[unique++] = value;
  }
  check_true("no native short cycle", unique > 240);

  // Встроенный распознаватель ГСЧ работает после внешних обратных вызовов BEFORE
  // и следует итоговому коду замены. Замена 3B на NOP не должна ни подставлять
  // значение, ни продвигать поток.
  static constexpr u32 REPLACEMENT_SEED = 3141592;
  core_61::configure_random_seed(true, REPLACEMENT_SEED);
  core_61::enable();
  set_x_bcd(0x00000007U);
  CommandHookProbe suppress_rng = {};
  suppress_rng.replace = true;
  suppress_rng.replacement = (u8) MK61_NOP;
  const core_61::Mk61CommandHookHandle suppress_rng_handle =
      core_61::register_mk61_command_hook(
          0x3B, core_61::Mk61CommandHookPhase::BEFORE_EXECUTE,
          &command_hook_probe, &suppress_rng);
  (void) next_random();
  check_near("3B->NOP keeps X", read_live_x(), 7.0, 1e-8);
  check_true("remove RNG suppression",
      core_61::unregister_mk61_command_hook(suppress_rng_handle));
  const double after_suppressed = next_random();
  const double unsuppressed_reference = first_random(true, REPLACEMENT_SEED);
  check_near("3B->NOP keeps RNG stream", after_suppressed, unsuppressed_reference, 0.0);

  // И наоборот, замена другой команды на 3B должна взвести ту же однократную
  // подстановку A7, которая используется штатной командой K RNG.
  static constexpr u32 REDIRECTED_SEED = 2718281;
  core_61::configure_random_seed(true, REDIRECTED_SEED);
  core_61::enable();
  CommandHookProbe redirect_to_rng = {};
  redirect_to_rng.replace = true;
  redirect_to_rng.replacement = 0x3B;
  const core_61::Mk61CommandHookHandle redirect_handle =
      core_61::register_mk61_command_hook(
          0xD7, core_61::Mk61CommandHookPhase::BEFORE_EXECUTE,
          &command_hook_probe, &redirect_to_rng);
  press_kip7();
  const double redirected_random = read_live_x();
  check_true("D7->3B produces RNG value",
      redirected_random >= 0.0 && redirected_random < 1.0);
  check_true("remove D7->3B redirect",
      core_61::unregister_mk61_command_hook(redirect_handle));
  const double redirected_reference = first_random(true, REDIRECTED_SEED);
  check_near("D7->3B uses enhanced seed", redirected_random, redirected_reference, 0.0);

  core_61::configure_random_seed(false, 1);
  check_true("enhanced mode disabled", !core_61::random_seed_enabled());
}

static void test_core_boundaries(void) {
  std::printf("core boundary regressions:\n");
  core_61::set_expanded_program_mode(false);
  core_61::enable();

  m_IK1302.comma = core_61::COMMA_RUN_POSITION;
  const char* run_indicator = MK61Emu_GetIndicatorStr(SYMBOLS);
  check_true("RUN indicator bounded", std::strlen(run_indicator) < INDICATOR_STRING_LENGTH);
  check_true("GetComma exported", MK61Emu_GetComma() == core_61::COMMA_RUN_POSITION);

  char update_buffer[INDICATOR_STRING_LENGTH + 2];
  std::memset(update_buffer, 0, sizeof(update_buffer));
  update_buffer[INDICATOR_STRING_LENGTH] = 'A';
  update_buffer[INDICATOR_STRING_LENGTH + 1] = 'B';
  core_61::update_indicator(update_buffer, SYMBOLS);
  check_true("update indicator bounded",
    update_buffer[INDICATOR_STRING_LENGTH] == 'A' &&
    update_buffer[INDICATOR_STRING_LENGTH + 1] == 'B');

  m_IK1302.comma = 10;
  check_true("left comma bounded", std::strlen(MK61Emu_GetIndicatorStr(SYMBOLS)) < INDICATOR_STRING_LENGTH);

  char valid_mantissa[8] = {'1','2','3','4','5','6','7','8'};
  char invalid_mantissa[8] = {'1','2','3','x','5','6','7','8'};
  u8 ring_before[SIZE_RING_M];
  std::memcpy(ring_before, ringM, sizeof(ringM));
  check_true("reject exponent +100", !write_stack_register(stack::X, ' ', valid_mantissa, 100));
  check_true("reject exponent -100", !write_stack_register(stack::X, ' ', valid_mantissa, -100));
  check_true("reject bad BCD digit", !write_stack_register(stack::X, ' ', invalid_mantissa, 0));
  check_true("rejection is atomic", std::memcmp(ring_before, ringM, sizeof(ringM)) == 0);

  char terminated[15];
  std::memset(terminated, 'X', sizeof(terminated));
  read_stack_register(stack::X, terminated, SYMBOLS);
  check_true("stack text terminated", terminated[14] == 0);

  for(int expanded = 0; expanded <= 1; expanded++) {
    core_61::set_expanded_program_mode(expanded != 0);
    core_61::enable();
    u8 input[core_61::CODE_PAGE_BUFFER_SIZE] = {};
    u8 output[core_61::CODE_PAGE_BUFFER_SIZE] = {};
    for(usize i = 0; i < core_61::program_steps(); i++) input[i] = (u8) ((i * 37u + 11u) & 0xFFu);
    core_61::set_code_page(input);
    core_61::get_code_page(output);
    check_true(expanded ? "expanded code page" : "classic code page",
      std::memcmp(input, output, core_61::program_steps()) == 0);
  }

  core_61::set_expanded_program_mode(true);
  core_61::enable();
  ringM[15 * 42 + 21] = 7;
  check_true("R_F seeded", MK61Emu_Read_R_mantissa(15) != 0);
  core_61::clear_memory_registers();
  check_true("R_F cleared", MK61Emu_Read_R_mantissa(15) == 0);
}

static void test_program_boundary_yield(void) {
  std::printf("program command boundary yield:\n");
  core_61::clear_mk61_program_boundary_hook();
  core_61::set_expanded_program_mode(false);
  core_61::enable();

  u8 page[core_61::CODE_PAGE_BUFFER_SIZE] = {};
  for(usize i = 0; i < core_61::program_steps(); i++) page[i] = 0x50;
  page[0] = 0x01;
  page[1] = 0x02;
  page[2] = 0x50;
  core_61::set_code_page(page);
  core_61::set_IP(0);

  ProgramBoundaryProbe probe = {};
  probe.target = 0;
  probe.yield = true;
  check_true("boundary hook installed",
      core_61::set_mk61_program_boundary_hook(
          &program_boundary_probe, &probe));
  check_true("second boundary hook rejected",
      !core_61::set_mk61_program_boundary_hook(
          &program_boundary_probe, &probe));

