bolknote/MK61S_MINI/tests/mk_math_self_test.cpp
  press_matrix({2, 9}); // C/P
  for(int i = 0; i < 32 && probe.calls == 0; i++) core_61::step();
  check_true("yielded before address 0",
      probe.calls > 0 && probe.last_address == 0 &&
      probe.last_opcode == 0x01 && core_61::program_boundary_yielded());

  const int repeated_before = probe.calls;
  core_61::step();
  check_true("same boundary repeats until resumed",
      probe.calls == repeated_before + 1 && probe.last_address == 0 &&
      probe.last_opcode == 0x01 && core_61::program_boundary_yielded());

  probe.target = 1;
  const int next_before = probe.calls;
  core_61::step();
  check_true("resume reaches following command",
      probe.calls > next_before && probe.last_address == 1 &&
      probe.last_opcode == 0x02 && core_61::program_boundary_yielded());

  core_61::ContextBuffer saved = {};
  check_true("caller context saved", core_61::save_context(saved));
  const i32 saved_ip = core_61::get_IP();
  set_x_bcd(0x12345678U);
  core_61::set_IP(17);
  check_true("caller context restored", core_61::restore_context(saved));
  check_true("boundary IP restored", core_61::get_IP() == saved_ip);

  core_61::clear_mk61_program_boundary_hook();
  check_true("boundary yield flag cleared",
      !core_61::program_boundary_yielded());
  for(int i = 0; i < 64 && core_61::is_RUN(); i++) core_61::step();
  check_true("program finishes after hook removal", core_61::is_CALC());

  // Адрес ловушки указывает на байт кода. Операнд двухбайтового перехода
  // используется внутри и не должен появляться как отдельная граница команды.
  core_61::enable();
  for(usize i = 0; i < core_61::program_steps(); i++) page[i] = 0x50;
  page[0] = 0x51; // БП / JMP
  page[1] = 0x02; // операнд назначения
  page[2] = 0x50;
  core_61::set_code_page(page);
  core_61::set_IP(0);
  probe = {};
  probe.target = 0;
  probe.yield = true;
  check_true("two-byte boundary hook installed",
      core_61::set_mk61_program_boundary_hook(
          &program_boundary_probe, &probe));
  press_matrix({2, 9});
  check_true("two-byte opcode boundary",
      probe.calls > 0 && probe.last_address == 0 &&
      probe.last_opcode == 0x51 && core_61::program_boundary_yielded());
  probe.target = 2;
  core_61::step();
  check_true("two-byte operand is not a boundary",
      probe.last_address == 2 && probe.last_opcode == 0x50 &&
      core_61::program_boundary_yielded());
  core_61::clear_mk61_program_boundary_hook();

  // CALL использует другой путь ПЗУ и действительно показывает последовательный
  // операнд по общему микроадресу предварительной выборки. Но результатом должны
  // быть только настоящие границы кодов: CALL 95, RET по 95, затем HLT по 2.
  core_61::enable();
  for(usize i = 0; i < core_61::program_steps(); i++) page[i] = 0x50;
  page[0] = 0x53; // ПП / CALL
  page[1] = 0x95; // операнд назначения в том виде, как он введён на калькуляторе
  page[2] = 0x50;
  page[95] = 0x52;
  core_61::set_code_page(page);
  core_61::set_IP(0);
  probe = {};
  check_true("CALL boundary hook installed",
      core_61::set_mk61_program_boundary_hook(
          &program_boundary_probe, &probe));
  press_matrix({2, 9});
  for(int i = 0; i < 256 && core_61::is_RUN(); i++) core_61::step();
  check_true("CALL operand is not a boundary",
      probe.calls == 3 &&
      probe.addresses[0] == 0 && probe.opcodes[0] == 0x53 &&
      probe.addresses[1] == 95 && probe.opcodes[1] == 0x52 &&
      probe.addresses[2] == 2 && probe.opcodes[2] == 0x50);
  check_true("CALL program finishes", core_61::is_CALC());
  core_61::clear_mk61_program_boundary_hook();

  // Вложенные вызовы тоже дважды показывают оба операнда; подавление должно
  // следовать стеку возвратов калькулятора, а не помнить лишь последний CALL.
  core_61::enable();
  for(usize i = 0; i < core_61::program_steps(); i++) page[i] = 0x50;
  page[0] = 0x53;
  page[1] = 0x90;
  page[2] = 0x50;
  page[90] = 0x53;
  page[91] = 0x95;
  page[92] = 0x52;
  page[95] = 0x52;
  core_61::set_code_page(page);
  core_61::set_IP(0);
  probe = {};
  check_true("nested CALL boundary hook installed",
      core_61::set_mk61_program_boundary_hook(
          &program_boundary_probe, &probe));
  press_matrix({2, 9});
  for(int i = 0; i < 512 && core_61::is_RUN(); i++) core_61::step();
  check_true("nested CALL operands are not boundaries",
      probe.calls == 5 &&
      probe.addresses[0] == 0 && probe.opcodes[0] == 0x53 &&
      probe.addresses[1] == 90 && probe.opcodes[1] == 0x53 &&
      probe.addresses[2] == 95 && probe.opcodes[2] == 0x52 &&
      probe.addresses[3] == 92 && probe.opcodes[3] == 0x52 &&
      probe.addresses[4] == 2 && probe.opcodes[4] == 0x50);
  check_true("nested CALL program finishes", core_61::is_CALC());
  core_61::clear_mk61_program_boundary_hook();
}

static void test_save_restore(void) {
  std::printf("core context save/restore isolation:\n");
  core_61::enable();
  MK61Emu_SetAngleUnit(DEGREE);
  core_61::edit_program = true;

  // Заполняем весь стек различающимися значениями.
  char mX[8] = {'1','2','3','4','5','0','0','0'}; write_stack_register(stack::X, ' ', mX, 2); // 123.45
  char mY[8] = {'6','7','8','9','0','0','0','0'}; write_stack_register(stack::Y, '-', mY, 0); // -6.789
  char mZ[8] = {'1','1','1','1','1','1','1','1'}; write_stack_register(stack::Z, ' ', mZ, 1); // 11.111111
  char mT[8] = {'9','8','7','6','5','4','3','2'}; write_stack_register(stack::T, ' ', mT, -3); // 0.0098765...

  const double bX = read_live_reg(stack::X);
  const double bY = read_live_reg(stack::Y);
  const double bZ = read_live_reg(stack::Z);
  const double bT = read_live_reg(stack::T);
  // X2 — защёлка экрана/дисплея, хранящаяся отдельно от стека X.
  char x2_before[24]; std::strncpy(x2_before, MK61Emu_GetIndicatorStr(SYMBOLS), sizeof(x2_before) - 1);
  x2_before[sizeof(x2_before) - 1] = 0;

  // Арендуем ядро для обычной операции и ошибки области определения (корня из
  // отрицательного числа, который фиксирует ЕГГОГ внутри аренды); ни одна из них
  // не должна проникнуть в рабочее состояние.
  (void) mk_math::sin(1.0);
  (void) mk_math::sqrt(-4.0);

  char x2_after[24]; std::strncpy(x2_after, MK61Emu_GetIndicatorStr(SYMBOLS), sizeof(x2_after) - 1);
  x2_after[sizeof(x2_after) - 1] = 0;

  check_true("angle preserved (DEGREE)", MK61Emu_GetAngleUnit() == DEGREE);
  check_true("edit mode preserved", core_61::edit_program);
  check_near("X preserved", read_live_reg(stack::X), bX, 1e-6);
  check_near("Y preserved", read_live_reg(stack::Y), bY, 1e-6);
  check_near("Z preserved", read_live_reg(stack::Z), bZ, 1e-6);
  check_near("T preserved", read_live_reg(stack::T), bT, 1e-6);
  check_true("X2/display preserved", std::strcmp(x2_before, x2_after) == 0);
}

int main(void) {
  test_pure_helpers();
  test_transcendental();
  test_authentic_core_smoke();
  test_rom_command_hooks();
  test_mk61_command_hooks();
  test_random_seed_hook();
  test_program_boundary_yield();
  test_core_boundaries();
  test_save_restore();

  if(g_failures == 0) {
    std::printf("mk_math_self_test: ok\n");
    return 0;
  }
  std::printf("mk_math_self_test: %d failure(s)\n", g_failures);
  return 1;
}
